package lv.nixx.poc.patterns.creational.FactoryMethod;

/*
 * Фабричный метод (англ. Factory Method также известен как Виртуальный конструктор (англ. Virtual Constructor)) 
 * порождающий шаблон проектирования, предоставляющий подклассам интерфейс для создания экземпляров некоторого класса.
 * В момент создания наследники могут определить, какой класс создавать. Иными словами, Фабрика делегирует 
 * создание объектов наследникам родительского класса. Это позволяет использовать в коде программы не 
 * специфические классы, а манипулировать абстрактными объектами на более высоком уровне.
 */
public class FactoryMethod {

}
